Revit 2018 API
RiseDropSymbol Enumeration
 This enumeration corresponds to the rise/drop symbol used in mechanical systems
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum RiseDropSymbol
Visual Basic
Public Enumeration RiseDropSymbol
Visual C++
public enum class RiseDropSymbol
Members
Member name | Description
NoSymbol |  No rise/drop graphics will be used
Outline |  Outline only no internal geometry
Cross |  Duct supply rise/drop with X pattern
CrossFilled |  Duct supply rise/drop with X pattern and top and bottom of X is filled
Slash |  Duct return rise/drop with / pattern
SlashFilled |  Duct return rise/drop with / pattern and lower right / is filled
Backslash |  Duct return rise/drop with \ pattern
BackslashFilled |  Duct return rise/drop with \ pattern and lower left \ is filled
Wye |  Duct exhaust rise/drop with \/ pattern
ReverseWye |  Duct exhaust rise/drop with /\ pattern
OutlineFilled |  Outline only no internal geometry and filled to be solid
YinYang |  Pipe contour rise/drop and 2 half circles (yin-yang)
YinYangFilled |  Pipe contour rise/drop and 2 half circles (yin-yang) left side is filled
BendThreeQuarterCircle |  Pipe 1 Line bend 3/4 circle
BendFullCircle |  Pipe 1 Line bend full circle
TeeHalfCircle |  Pipe 1 Line junction 1/2 circle on each side
TeeFullCircle |  Pipe 1 Line junction full circle
CrossNoOutline |  Cable Tray 1 Line a cross without outline
See Also
Autodesk.Revit.DB.Mechanical Namespace